# parepare dataset for QueryShare

## sample table

In [68]:
import os
import sqlite3
import pandas as pd
from sklearn import datasets
from sklearn.datasets import load_linnerud
import hashlib
import numexpr
import datetime

In [6]:
os.chdir("/home/jovyan/QueryShare/treat_db/")
os.getcwd()

'/home/jovyan/QueryShare/treat_db'

In [8]:
conn = sqlite3.connect('data/user_db.db')

In [4]:
iris = datasets.load_iris()
iris= pd.DataFrame(iris.data)
iris.head()

     0    1    2    3
0  5.1  3.5  1.4  0.2
1  4.9  3.0  1.4  0.2
2  4.7  3.2  1.3  0.2
3  4.6  3.1  1.5  0.2
4  5.0  3.6  1.4  0.2

## tableを調査

In [5]:
iris.to_sql("iris_test", conn, if_exists="replace")
res = conn.execute("SELECT name FROM sqlite_master WHERE type='table';")
for name in res:
    print(name[0])

linnerud_test
iris_test

# 跳躍データセットを作成する

In [10]:
linnerud = load_linnerud()
linnerud = pd.DataFrame(linnerud.data, columns=linnerud.feature_names)
linnerud

linnerud.to_sql("linnerud_test", conn, if_exists="replace")
res = conn.execute("SELECT name FROM sqlite_master WHERE type='table';")
for name in res:
    print(name[0])

iris_test
linnerud_test

## user dataを作る

In [79]:
# dbファイルを作成
conn_user = sqlite3.connect('/home/jovyan/QueryShare/app/data/user_db.db')

In [80]:
# ハッシュからID作成
hashlib.md5(b'hello hello').hexdigest()

'f52d885484f1215ea500a805a86ff443'

In [81]:
# ユーザーテーブルに使うデータを定義する
user_table = pd.DataFrame({ 'Date' : [datetime.date.today(), datetime.date.today(), datetime.date.today()],
                                                    'Mail'  : ['samle1@gmail.com', 'sample2@gmail.com', 'sample3@gmail.com'],
                                                    'Name' : ['qs_user1', 'qs_user2', 'qs_user3'],
                                                    'Passward' : ['pass1', 'pass2', 'pass3']
                                                  })
user_table

         Date               Mail      Name Passward
0  2018-06-29   samle1@gmail.com  qs_user1    pass1
1  2018-06-29  sample2@gmail.com  qs_user2    pass2
2  2018-06-29  sample3@gmail.com  qs_user3    pass3

In [82]:
user_table.to_sql("user_table", conn_user, if_exists="replace")
res = conn.execute("SELECT name FROM sqlite_master WHERE type='table';")
for name in res:
    print(name[0])

sql_table
user_table

In [84]:
conn_user = sqlite3.connect("/home/jovyan/QueryShare/app/data/user_db.db")
df_user_table = pd.read_sql("select * from user_table", conn_user)
df_user_table

   index        Date               Mail      Name Passward
0      0  2018-06-29   samle1@gmail.com  qs_user1    pass1
1      1  2018-06-29  sample2@gmail.com  qs_user2    pass2
2      2  2018-06-29  sample3@gmail.com  qs_user3    pass3

In [85]:
VALID_USERNAME_PASSWORD_PAIRS = [
    ['qs_user1', 'pass1'],
    ['qs_user2', 'pass2'],
    ['qs_user3', 'pass3']
]
VALID_USERNAME_PASSWORD_PAIRS

[['qs_user1', 'pass1'], ['qs_user2', 'pass2'], ['qs_user3', 'pass3']]

In [89]:
# Keep this out of source code repository - save in a file or a database
VALID_USERNAME_PASSWORD_PAIRS = [
    [name, passward] for name,passward in  zip(df_user_table.Name, df_user_table.Passward) 
]
VALID_USERNAME_PASSWORD_PAIRS

[['qs_user1', 'pass1'], ['qs_user2', 'pass2'], ['qs_user3', 'pass3']]

## sql tableを作る

In [106]:
# dbファイルを作成
conn_sql = sqlite3.connect('/home/jovyan/QueryShare/app/data/sql_db.db')

In [107]:
sql_table = pd.DataFrame({'ID' : ['qs_user1', 'qs_user1', 'qs_user1', 'qs_user1', 'qs_user2', 'qs_user2' ],
                                                'Name' : ['test_sqlA_1.sql',
                                                                 'test_sqlA_2.sql',
                                                                 'test_sqlA_3.sql', 
                                                                 'test_sqlA_4.sql',
                                                                 'test_sqlB_5.sql',
                                                                 'test_sqlB_6.sql'],
                                                'Statement': ["SELECT * FROM linnerud_test where jumps > 100;",
                                                                        "SELECT * \nFROM iris\nWHERE Species = 'setosa'",
                                                                        "SELECT * FROM iris WHERE ...",
                                                                        "select x from test order by x collate reverse",
                                                                        "SELECT * \nFROM iris\nWHERE",
                                                                        "SELECT * \nFROM .... よくわからない"]
                                                 })
sql_table

         ID             Name                                       Statement
0  qs_user1  test_sqlA_1.sql  SELECT * FROM linnerud_test where jumps > 100;
1  qs_user1  test_sqlA_2.sql  SELECT * \nFROM iris\nWHERE Species = 'setosa'
2  qs_user1  test_sqlA_3.sql                    SELECT * FROM iris WHERE ...
3  qs_user1  test_sqlA_4.sql   select x from test order by x collate reverse
4  qs_user2  test_sqlB_5.sql                     SELECT * \nFROM iris\nWHERE
5  qs_user2  test_sqlB_6.sql                    SELECT * \nFROM .... よくわからない

In [108]:
sql_table.to_sql("sql_table", conn_sql, if_exists="replace")
res = conn.execute("SELECT name FROM sqlite_master WHERE type='table';")
for name in res:
    print(name[0])

user_table
sql_table

In [109]:
sql_table.Statement

0    SELECT * FROM linnerud_test where jumps > 100;
1    SELECT * \nFROM iris\nWHERE Species = 'setosa'
2                      SELECT * FROM iris WHERE ...
3     select x from test order by x collate reverse
4                       SELECT * \nFROM iris\nWHERE
5                      SELECT * \nFROM .... よくわからない
Name: Statement, dtype: object

# sqlレコードを更新する

In [127]:
conn_sqldb = sqlite3.connect("/home/jovyan/QueryShare/app/data/sql_db.db")
# define statement
statement = "select * from sql_table"
df_fromdb = pd.read_sql(statement, conn)

df_fromdb

,index,ID,Name,Statement
0,0.0,qs_user1,test_sqlA_1.sql,SELECT * FROM linnerud_test where jumps > 100;
1,1.0,qs_user1,test_sqlA_2.sql,SELECT * \nFROM iris\nWHERE Species = 'setosa'
2,2.0,qs_user1,test_sqlA_3.sql,SELECT * FROM iris WHERE ...
3,3.0,qs_user1,test_sqlA_4.sql,select x from test order by x collate reverse
4,4.0,qs_user2,test_sqlB_5.sql,SELECT * \nFROM iris\nWHERE
5,5.0,qs_user2,test_sqlB_6.sql,SELECT * \nFROM .... よくわからない
6,NaN,qs_user1,add_sample.sql,SELECT * FROM TEST
7,NaN,qs_user1,add_sample.sql,SELECT * FROM TEST

In [128]:
# RUNのstatementに変更

c_username = "qs_user1"
c_filename = "test_sqlA_2.sql"


c = conn_sqldb.cursor()
change_commit_sql = "replace into sql_table (ID, Name, Statement) values(?,?,?)"
data = (c_username, c_filename, 'select * from sql_table NEW;')
c.execute(change_commit_sql, data)
conn_sql.commit()

In [129]:
statement = "select * from sql_table"
df_fromdb = pd.read_sql(statement, conn_sqldb)

df_fromdb

,index,ID,Name,Statement
0,0.0,qs_user1,test_sqlA_1.sql,SELECT * FROM linnerud_test where jumps > 100;
1,1.0,qs_user1,test_sqlA_2.sql,SELECT * \nFROM iris\nWHERE Species = 'setosa'
2,2.0,qs_user1,test_sqlA_3.sql,SELECT * FROM iris WHERE ...
3,3.0,qs_user1,test_sqlA_4.sql,select x from test order by x collate reverse
4,4.0,qs_user2,test_sqlB_5.sql,SELECT * \nFROM iris\nWHERE
5,5.0,qs_user2,test_sqlB_6.sql,SELECT * \nFROM .... よくわからない
6,NaN,qs_user1,add_sample.sql,SELECT * FROM TEST
7,NaN,qs_user1,add_sample.sql,SELECT * FROM TEST
8,NaN,qs_user1,test_sqlA_2.sql,select * from sql_table NEW;

# sqlレコードを追加する

In [113]:
c = conn_sql.cursor()
# テーブル作成
# c.execute('create table artoria (name text, atk int, hp int)')

# データ追加(レコード登録)
sql = 'insert into sql_table (ID, Name, Statement) values (?,?,?)'
data = ('qs_user1', "add_sample.sql", "SELECT * FROM TEST")
c.execute(sql, data)

# コミット
conn_sql.commit()

In [115]:
conn_sqldb = sqlite3.connect("/home/jovyan/QueryShare/app/data/sql_db.db")
df_sql_table = pd.read_sql("select * from sql_table", conn_sqldb)
df_sql_table

,index,ID,Name,Statement
0,0.0,qs_user1,test_sqlA_1.sql,SELECT * FROM linnerud_test where jumps > 100;
1,1.0,qs_user1,test_sqlA_2.sql,SELECT * \nFROM iris\nWHERE Species = 'setosa'
2,2.0,qs_user1,test_sqlA_3.sql,SELECT * FROM iris WHERE ...
3,3.0,qs_user1,test_sqlA_4.sql,select x from test order by x collate reverse
4,4.0,qs_user2,test_sqlB_5.sql,SELECT * \nFROM iris\nWHERE
5,5.0,qs_user2,test_sqlB_6.sql,SELECT * \nFROM .... よくわからない
6,NaN,qs_user1,add_sample.sql,SELECT * FROM TEST
7,NaN,qs_user1,add_sample.sql,SELECT * FROM TEST

In [60]:
c_user_id = 'AAA'
sql_table.query('ID in "' + c_user_id + '"')

    ID             Name                                       Statement
0  AAA  test_sqlA_1.sql  SELECT * FROM linnerud_test where jumps > 100;
1  AAA  test_sqlA_2.sql  SELECT * \nFROM iris\nWHERE Species = 'setosa'
2  AAA  test_sqlA_3.sql                    SELECT * FROM iris WHERE ...
3  AAA  test_sqlA_4.sql   select x from test order by x collate reverse

In [62]:
options=[{'label': i, 'value': j} for i,j in zip(sql_table.Name,
                                                                 sql_table.Statement)]
options

[{'label': 'test_sqlA_1.sql',
  'value': 'SELECT * FROM linnerud_test where jumps > 100;'},
 {'label': 'test_sqlA_2.sql',
  'value': "SELECT * \nFROM iris\nWHERE Species = 'setosa'"},
 {'label': 'test_sqlA_3.sql', 'value': 'SELECT * FROM iris WHERE ...'},
 {'label': 'test_sqlA_4.sql',
  'value': 'select x from test order by x collate reverse'},
 {'label': 'test_sqlB_5.sql', 'value': 'SELECT * \nFROM iris\nWHERE'},
 {'label': 'test_sqlB_6.sql', 'value': 'SELECT * \nFROM .... よくわからない'}]

In [67]:
for now in sql_table.index.tolist():
    print(now)

0
1
2
3
4
5

In [96]:
test_query=[statement for statement in sql_table_current.Statement]
test_query[0]

'SELECT * FROM linnerud_test where jumps > 100;'

In [97]:
[sql for sql in sql_table.Name]

['test_sqlA_1.sql',
 'test_sqlA_2.sql',
 'test_sqlA_3.sql',
 'test_sqlA_4.sql',
 'test_sqlB_5.sql',
 'test_sqlB_6.sql']